#### 1. Import pandas library

In [1]:
import pandas as pd

#### 2. Import BigQuery library

In [2]:
from google.cloud import bigquery

#### 3. Create a connection to BigQuery

In [3]:
import os
os.environ["GOOGLE_APPLICATION_CREDENTIALS"]="/Users/plopezbar/Desktop/ironhack_service_account_big_query.json"

In [4]:
import six
six.moves.reload_module(six)

In [5]:
client = bigquery.Client()

#### 4. Import data from the users table from the stackoverflow public database for United Kingdom only

In [6]:
sql= '''
SELECT *

FROM 
    `bigquery-public-data.stackoverflow.users` SOU
    
WHERE
  location = 'United Kingdom'
'''

In [7]:
query_job = client.query(query=sql)
uk_users =query_job.to_dataframe()
uk_users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13952 entries, 0 to 13951
Data columns (total 13 columns):
id                   13952 non-null int64
display_name         13952 non-null object
about_me             5705 non-null object
age                  0 non-null object
creation_date        13952 non-null datetime64[ns, UTC]
last_access_date     13952 non-null datetime64[ns, UTC]
location             13952 non-null object
reputation           13952 non-null int64
up_votes             13952 non-null int64
down_votes           13952 non-null int64
views                13952 non-null int64
profile_image_url    8565 non-null object
website_url          4637 non-null object
dtypes: datetime64[ns, UTC](2), int64(5), object(6)
memory usage: 1.4+ MB

In [8]:
uk_users.head()

,id,display_name,about_me,age,creation_date,last_access_date,location,reputation,up_votes,down_votes,views,profile_image_url,website_url
0,5337,J Hunt,<p></p>,None,2008-09-09 09:07:41.840000+00:00,2015-02-19 16:29:45.007000+00:00,United Kingdom,602,1,0,127,None,None
1,6910,Jonathan,<ul><li>Started programming with Visual Basic ...,None,2008-09-15 12:48:35.843000+00:00,2019-11-29 15:15:39.270000+00:00,United Kingdom,21315,897,8,831,https://www.gravatar.com/avatar/592695fec5a951...,http://www.toolan.net
2,33682,James Crowley,"<p>Co-founder at <a href=""http://www.fundapps....",None,2008-11-03 15:43:51.987000+00:00,2019-11-19 17:11:30.080000+00:00,United Kingdom,3218,124,3,448,None,http://www.jamescrowley.net/
3,73789,Perrin255,None,None,2009-03-04 16:50:24.240000+00:00,2019-04-26 14:48:57.903000+00:00,United Kingdom,431,55,0,49,None,None
4,90996,badmanj,None,None,2009-04-15 09:01:26.433000+00:00,2010-04-09 10:31:19.850000+00:00,United Kingdom,178,3,0,51,None,None

#### 5. Rename id column to user_id

In [9]:
uk_users = uk_users.rename(columns={"id": "user_id"})
uk_users.head(1)

,user_id,display_name,about_me,age,creation_date,last_access_date,location,reputation,up_votes,down_votes,views,profile_image_url,website_url
0,5337,J Hunt,<p></p>,None,2008-09-09 09:07:41.840000+00:00,2015-02-19 16:29:45.007000+00:00,United Kingdom,602,1,0,127,None,None

#### 6. Import from the stackoverflow_posts table all items which have up to 20 view counts and only select 'id', 'owner_user_id', 'score', 'view_count', 'comment_count', 'favorite_count'

In [18]:
sql= '''
SELECT 
    id,
    owner_user_id,
    score,
    view_count,
    comment_count,
    favorite_count,
FROM 
    `bigquery-public-data.stackoverflow.stackoverflow_posts` SOPO
WHERE 
    view_count <= 20
GROUP BY
  1,2,3,4,5,6

'''

In [19]:
query_job = client.query(query=sql)
posts =query_job.to_dataframe()
posts.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 325610 entries, 0 to 325609
Data columns (total 6 columns):
id                325610 non-null int64
owner_user_id     324368 non-null float64
score             325610 non-null int64
view_count        325610 non-null int64
comment_count     325610 non-null int64
favorite_count    14499 non-null float64
dtypes: float64(2), int64(4)
memory usage: 14.9 MB

In [20]:
posts.head()

         id  owner_user_id  score  view_count  comment_count  favorite_count
0  37762707      2766161.0      0           3              0             NaN
1  37455098      6379693.0     -1           2              0             NaN
2  35345367      5048561.0      0           3              0             NaN
3  37253113      6013377.0      0           3              0             NaN
4  37513722      6113474.0      0           2              0             1.0

#### 7. Rename id column to post_id and owner_user_id to user_id

In [35]:
posts = posts.rename(columns={"id": "post_id", "owner_user_id": "user_id"})
posts.head(1)

    post_id    user_id  score  view_count  comment_count  favorite_count
0  37762707  2766161.0      0           3              0             NaN

#### 8. Define new dataframes for users and posts with the following selected columns:
    **users columns**: user_id, reputation,views,up_votes,down_votes
    **posts columns**: post_id, score,user_id,view_count,comment_count

In [36]:
uk_users1 = uk_users[['user_id','reputation','views', 'up_votes', 'down_votes']]
uk_users1.head()

   user_id  reputation  views  up_votes  down_votes
0     5337         602    127         1           0
1     6910       21315    831       897           8
2    33682        3218    448       124           3
3    73789         431     49        55           0
4    90996         178     51         3           0

In [37]:
posts1 = posts[['post_id', 'score', 'user_id', 'view_count', 'comment_count']]
posts1.head()

    post_id  score    user_id  view_count  comment_count
0  37762707      0  2766161.0           3              0
1  37455098     -1  6379693.0           2              0
2  35345367      0  5048561.0           3              0
3  37253113      0  6013377.0           3              0
4  37513722      0  6113474.0           2              0

#### 8. Merge both dataframes, users and posts. 
You will need to make a [merge](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.merge.html) of posts and users dataframes.

In [40]:
merge_df = uk_users1.merge(posts1, left_on='user_id', right_on='user_id')
merge_df.head()

,user_id,reputation,views,up_votes,down_votes,post_id,score,view_count,comment_count
0,33682,3218,448,124,3,31383344,0,11,0
1,1010198,412,141,19,0,33721783,0,15,0
2,1010198,412,141,19,0,36489861,0,16,0
3,450600,5443,338,66,7,34445677,0,13,0
4,450600,5443,338,66,7,32949627,0,20,0

#### 9. How many missing values do you have in your merged dataframe?

In [43]:
# By columns
merge_df.isnull().sum()

user_id          0
reputation       0
views            0
up_votes         0
down_votes       0
post_id          0
score            0
view_count       0
comment_count    0
dtype: int64

In [44]:
# Total
merge_df.isnull().sum().sum()

0

#### Bonus: Identify extreme values in your merged dataframe, create a dataframe called outliers with the same columns as our data set and calculate the bounds. The values of the outliers dataframe will be the values of the merged_df that fall outside that bounds. You will need to save your outliers dataframe to a csv file on your-code folder. Hint: post_id cannot have outliers!